"""
这是我们的第一个模块。主要是提供了飞行控制功能。
作者：wang
日期：2020-6-10
版本：1.0
"""


age = 10  # age保存用户的年龄。

# 用户的名字存储在name变量中
name = "Wang"


'''
这个方法提供了飞行姿态控制功能.
方法接收一个参数.表示当前的空气压力.
返回执行的结果
'''

result = 89
if result >= 60:
      print("及格")
      print("很棒")


def a():
    pass

a = 1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+1+\
    1+1+1+1+1+1+1+1+1+1+1
print('a:', a)

s = "pass语句什么也不做，一般作为占位符或者创建占位程序，"\
    "pass语句不会执行任何操作，比如pass语句什么也不做，"\
    "一般作为占位符或者创建占位程序，pass语句不会执行任何操作，比如"
print(s)

s = """pass语句什么也不做，一般作为占位符或者创建占位程序，pass语句不会执行任何操作，比如
pass语句什么也不做，一般作为占位符或者创建占位程序，pass语句不会执行任何操作，比如
pass语句什么也不做，一般作为占位符或者创建占位程序，pass语句不会执行任何操作，比如"""
print(s)

a=1; b=2; c=3

print("hello")
print("")
